<a href="https://colab.research.google.com/github/jorgejoshuatt/TratamientoDatosPython/blob/main/TratamientoDatosPython/Complementos/03PandasLectura.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

*JORGE JOSHUA TREJO MARTINEZ*

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#Leer CSV
df_clientes=pd.read_csv('datos/clientes.csv')
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ident            5 non-null      int64
 1   nombre           5 non-null      object
 2   primer_apellido  5 non-null      object
 3   suc_origen       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [ ]:
df_clientes

   ident   nombre primer_apellido suc_origen
0  19232  Adriana         Sánchez     CDMX01
1  19233   Marcos          García     CDMX02
2  19234    Rubén          Rincón     CDMX02
3  19235   Samuel           Oliva     CDMX01
4  19236   Martha        Martínez     CDMX03

In [ ]:
df_facturas=pd.read_csv('datos/facturas.csv')
df_facturas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   folio     10 non-null     int64
 1   sucursal  10 non-null     object
 2   monto     10 non-null     float64
 3   fecha     10 non-null     object
 4   cliente   10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [ ]:
df_facturas

   folio sucursal     monto                fecha  cliente
0  15234   CDMX01   1420.00  2019-03-11 17:24:00    19234
1  15235    MTY01   1532.00  2019-03-24 14:46:00    19232
2  15236   CDMX02    890.00  2019-03-25 17:58:00    19235
3  15237   CDMX02   1300.00  2019-03-27 13:11:00    19233
4  15238    MTY01   3121.47  2019-03-31 10:25:00    19236
5  15239    GDL01   1100.50  2019-04-01 18:32:00    19237
6  15240   CDMX02  12230.00  2019-04-03 11:43:00    19232
7  15241    MTY01    230.85  2019-04-04 16:55:00    19233
8  15242    GDL01   1569.00  2019-04-05 12:59:00    19232
9  15243    GDL01   2569.00  2019-05-05 12:59:00    19232

In [ ]:
#Leer CSV desde URL
df_jugadores=pd.read_csv('https://raw.githubusercontent.com/omarmendoza564/datos/main/datos/jugadores.csv')
df_jugadores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1034 entries, 0 to 1033
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            1034 non-null   object
 1   Team            1034 non-null   object
 2   Position        1034 non-null   object
 3   Height(inches)  1034 non-null   int64
 4   Weight(pounds)  1034 non-null   int64
 5   Age             1034 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 48.6+ KB

In [ ]:
df_jugadores

,Name,Team,Position,Height(inches),Weight(pounds),Age
0,Adam_Donachie,BAL,Catcher,74,180,22.99
1,Paul_Bako,BAL,Catcher,74,215,34.69
2,Ramon_Hernandez,BAL,Catcher,72,210,30.78
3,Kevin_Millar,BAL,First_Baseman,72,210,35.43
4,Chris_Gomez,BAL,First_Baseman,73,188,35.71
...,...,...,...,...,...,...
1029,Brad_Thompson,STL,Relief_Pitcher,73,190,25.08
1030,Tyler_Johnson,STL,Relief_Pitcher,74,180,25.73
1031,Chris_Narveson,STL,Relief_Pitcher,75,205,25.19
1032,Randy_Keisler,STL,Relief_Pitcher,75,190,31.01
1033,Josh_Kinney,STL,Relief_Pitcher,73,195,27.92

In [ ]:
#Leer json desde URL
df_iris=pd.read_json('https://raw.githubusercontent.com/domoritz/maps/master/data/iris.json')
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sepalLength  150 non-null    float64
 1   sepalWidth   150 non-null    float64
 2   petalLength  150 non-null    float64
 3   petalWidth   150 non-null    float64
 4   species      150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
#Leer json local
df_alumnos=pd.read_json('datos/alumnos_calif_jsonArray.json')
df_alumnos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 808 entries, 0 to 807
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   clave_alu     808 non-null    int64
 1   ap_paterno    808 non-null    object
 2   ap_materno    808 non-null    object
 3   nombre        808 non-null    object
 4   sexo          682 non-null    object
 5   ciudad        698 non-null    object
 6   email         634 non-null    object
 7   calificacion  808 non-null    float64
 8   curp          606 non-null    object
dtypes: float64(1), int64(1), object(7)
memory usage: 56.9+ KB

In [ ]:
df_alumnos

,clave_alu,ap_paterno,ap_materno,nombre,sexo,ciudad,email,calificacion,curp
0,11030172,BORBOLLA,RAMOS,ARGELIA,F,QUERETARO,argi_gogos@hotmail.com,5.0,NaN
1,11030173,CASTRO,MANCERA,KARLA MARIANA,F,SANTIAGO DE QUERETARO,NaN,5.0,NaN
2,11030177,FERRUSCA,ANDRADE,OCTAVIO,M,QUERETARO,tavoferrus_11@hotmail.com,5.0,NaN
3,11030178,GARCIA,GOMEZ,RAFAEL,M,QUERETARO,arobertogarcia@prodigy.net.mx,5.0,220140190055288
4,11030180,GUTIERREZ,FLORES,CARLOS DAVID,M,QUERETARO,chorok_skp91@hotmail.com,5.0,GUFC910124HDFTLR04
...,...,...,...,...,...,...,...,...,...
803,12080001,,,,NaN,NaN,NaN,5.0,NaN
804,14080001,MEJIA,JIMENEZ,LUISA,NaN,NaN,NaN,5.0,NaN
805,14080002,MEJIA,JIMENEZ,LUISA,NaN,NaN,NaN,5.0,NaN
806,14080003,MEJIA,JIMENEZ,LUISA,NaN,NaN,NaN,5.0,NaN
807,14080004,MEJIA,JIMENEZ,LUISA,NaN,NaN,NaN,10.0,NaN

In [ ]:
df_alumnos['calificacion'].describe()

count    808.000000
mean       6.061335
std        1.583888
min        5.000000
25%        5.000000
50%        5.000000
75%        7.456250
max       10.000000
Name: calificacion, dtype: float64

In [ ]:
#Leer excel desde una hoja particular sin nombres de campos
df_carrera=pd.read_excel(
    'datos/BDCarrera.xlsx',
    sheet_name='BdCarrera2022',
    header=None,
    names=['MATRICULA', 'SEDE', 'NOMBRE', 'EDAD', 'SEXO', 'NACIONALIDAD', 'ESTADO_CIVIL', 'MODALIDAD', 'PROM_PSU', 'PROM_NEM', 'SITUACION_ECONOMICA', 'ESTADO', 'CALIFICACION', 'CURSO'])

df_carrera.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 283 entries, 0 to 282
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   MATRICULA            283 non-null    int64
 1   SEDE                 283 non-null    object
 2   NOMBRE               283 non-null    object
 3   EDAD                 283 non-null    int64
 4   SEXO                 283 non-null    object
 5   NACIONALIDAD         283 non-null    object
 6   ESTADO_CIVIL         283 non-null    object
 7   MODALIDAD            283 non-null    int64
 8   PROM_PSU             283 non-null    int64
 9   PROM_NEM             283 non-null    float64
 10  SITUACION_ECONOMICA  283 non-null    int64
 11  ESTADO               283 non-null    object
 12  CALIFICACION         283 non-null    int64
 13  CURSO                283 non-null    object
dtypes: float64(1), int64(6), object(7)
memory usage: 31.1+ KB

In [ ]:
#Lectura de un BD relacional Mysql
#Instalar el driver de mysql y sqlalchemy (ORM)
##!pip install mysql-connector-python==8.0.19 sqlalchemy==1.3.15

In [ ]:
from sqlalchemy import create_engine

us='fesalu'
passwd='bdfes123'
url='bd.arcelia.net'
puerto='3306'
bd='bdcolegiosource'
auth='mysql_native_password'

str_conn='mysql+mysqlconnector://{0}:{1}@{2}:{3}/{4}?auth_plugin={5}'
str_conn=str_conn.format(us,passwd,url,puerto,bd,auth)
print(str_conn)
sql='''SELECT * FROM Alumnos WHERE DATE(fnac)>=%s'''

conn=create_engine(str_conn)

mysql+mysqlconnector://fesalu:bdfes123@bd.arcelia.net:3306/bdcolegiosource?auth_plugin=mysql_native_password

In [ ]:
df_mysql=pd.read_sql_query(sql=sql, con=conn,params=['2000-01-01'])
df_mysql.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   matricula  9 non-null      object
 1   nombre     9 non-null      object
 2   paterno    8 non-null      object
 3   fnac       9 non-null      object
 4   estatura   9 non-null      float64
dtypes: float64(1), object(4)
memory usage: 488.0+ bytes

In [ ]:
df_mysql

  matricula  nombre    paterno        fnac  estatura
0        1A    Juan      Lopez  2001-01-01      1.78
1       1GG   Maria  Paterno 1  2001-03-20      1.60
2      21OL   Donna      River  2002-01-09      1.69
3       2GG   Maria  Paterno 2  2001-03-20      1.62
4        3B   Perla     Calles  2001-01-20      1.60
5        4A  Carlos     Madero  2001-01-01      1.68
6        6C   Jesus     Garcia  2001-03-20      1.65
7        7B    Gema       None  2001-03-20      1.53
8      A744   Amaro     Garcia  2001-09-23      1.83

In [ ]:
#Escribir un DF a un archivo csv
df_mysql.to_csv('datos/df/alumnos_coma.csv', index_label='ID')

In [ ]:
#Escribir un DF a un archivo csv separado por pipe
df_mysql.to_csv('datos/df/alumnos_pipe.csv',
index=False,
sep='|')

In [ ]:
#Escribir a archivos Json orientado a campos
df_mysql.to_json('datos/df/alumnos.json')

In [ ]:
#Escribir a archivos Json orientado a registros
df_mysql.to_json('datos/df/alumnos_registros.json',
orient="records")

In [ ]:
#Escribir a archivos Json orientado a tabla
df_mysql.to_json('datos/df/alumnos_tabla.json',
orient="table")

In [ ]:
#Escribir a archivos Json orientado a valores
df_mysql.to_json('datos/df/alumnos_valores.json',
orient="values")

In [ ]:
#Escribir DF a archivos de Excel
df_mysql.to_excel('datos/df/alumnos_excel.xlsx',
sheet_name='AlumnosArcelia',
index=False)

In [ ]:
df_mysql2=df_mysql.copy()

In [ ]:
#Escribir en multiples hojas en un archivo de excel
with pd.ExcelWriter('datos/df/alumnos_hojas.xlsx') as w:
    df_mysql.to_excel(w,sheet_name="Alumnos01")
    df_mysql2.to_excel(w,sheet_name="Alumnos02")

In [ ]:
#Escribir en un archivo de excel existente
with pd.ExcelWriter('datos/df/alumnos_hojas.xlsx',
    mode='a', engine="openpyxl",) as w:
    df_mysql.to_excel(w,sheet_name="Alumnos03",index=False)

In [ ]:
#Leer el archivo en csv
#Dejar los nombres de las columnas del DF en español
#Indicar cuantos datos NaN existen en el DF y en cada columna
#Mostrar los estadisticos generales de la columna edad
#Listar solo los pasajeros mujeres (female)
#Escribir el DF en un Json, un csv y un excel (dos hojas)
#Enviar archivo ipynb, pdf con todo el notebook incluido resultados, un json, un csv y un excel